# Taps
tap 'shivammathur/php'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'grep'
brew 'ripgrep'
brew 'jq'
brew 'xq'
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'svn'
brew 'openconnect'
brew 'pwgen'
brew 'ranger'
cask 'wireshark'

# Development
brew 'git'
cask 'docker-desktop'
cask 'phpstorm'
cask 'pycharm'
cask 'datagrip'
cask 'goland'
brew 'go'
brew 'node'

cask 'orbstack'
brew 'dive'
cask 'github'
brew 'composer'
brew 'php@8.4'
brew 'php@8.3'
brew 'php@8.2'
brew 'php@8.1'
brew 'shivammathur/php/php@7.4'
# brew tap infection/homebrew-infection
brew "php-cs-fixer"
cask 'soapui'
brew 'htop'
cask 'wireshark-app'
brew 'telnet'
brew 'websocat'
cask 'commander-one'
# brew 'mc'
# mc does not work, use https://github.com/krolig/mc/releases/download/4.8.26/mc-4.8.26-x86_64-ncurses.dmg - found via https://midnight-commander.org
brew 'wget'
cask 'rar'
cask 'utm'
brew 'qemu'

# company software
cask '1password'
cask 'slack'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'drawio'
cask 'google-drive'

# tooling
cask 'rectangle'
cask 'raycast'
cask 'whatsapp'
cask 'adium'
cask 'cyberduck'
cask 'daisydisk'
cask 'far2l'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

cask 'caffeine'
cask 'betterdisplay'
# # Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'MyWoosh', id: 1498889644
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Spring', id: 1508706541
# mas 'Things', id: 904280696
