# Taps
tap 'homebrew/bundle'
tap 'shivammathur/php'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'grep'
brew 'ripgrep'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'svn'
brew 'openconnect'

# Development
brew 'git'
cask 'docker'
cask 'phpstorm'
cask 'pycharm'
cask 'datagrip'
cask 'orbstack'
cask 'github'
brew 'composer'
brew 'php@8.4'
brew 'php@8.3'
brew 'php@8.1'
brew 'shivammathur/php/php@7.4'
cask 'soapui'
brew 'wireshark'

# company software
cask '1password'
cask 'slack'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'

# tooling
cask 'rectangle'
cask 'raycast'
cask 'whatsapp'
cask 'adium'
cask 'cyberduck'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

cask 'caffeine'
cask 'betterdisplay'
# # Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'MyWoosh', id: 1498889644
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Spring', id: 1508706541
# mas 'Things', id: 904280696
